wp_backend/app/controllers/api/prompts_controller.rb

SELECT "prompts".* FROM "prompts"
---
    def index
        @prompts = Prompt.all

SELECT  "prompts".* FROM "prompts" WHERE "prompts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @prompt = Prompt.find_by(id: params[:id])