wp_backend/app/controllers/api/responses_controller.rb

    def index
        @responses = Response.all
---
SELECT "responses".* FROM "responses"

    def show
        @response = Response.find_by(id: params[:id])
---
SELECT  "responses".* FROM "responses" WHERE "responses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]